app/controllers/organizations_controller.rb

   def home
    @organizations  = Organization.all
---
SELECT "organizations".* FROM "organizations"

    def create
      @organizations = Organization.new(org_params)
      @organizations.creator_id = current_user.id
      if @organizations.save
---
INSERT INTO "organizations" ("creator_id", "name", "description", "era_served", "category", "url", "address1", "address2", "city", "state", "zipcode", "phone", "email", "created_at", "updated_at", "latitude", "longitude") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12, $13, $14, $15, $16, $17) RETURNING "id"

    def show
      @organization = Organization.find(params[:id])
---
SELECT  "organizations".* FROM "organizations" WHERE "organizations"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

    def find_org
      @organizations = Organization.find_by_id(params[:id])
---
SELECT  "organizations".* FROM "organizations" WHERE "organizations"."id" = $1 LIMIT $2  [["id", nil], ["LIMIT", 1]]