app/controllers/reviews_controller.rb

  def create
    @review = Review.new(review_params)
    @review.user_id = current_user.id
    if @review.save
---
INSERT INTO "reviews" ("user_id", "rating", "feedback", "recommend", "organization_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"  [["user_id", 3], ["rating", 4], ["feedback", "Cools"], ["recommend", true], ["organization_id", 3], ["created_at", 2017-04-06 21:34:12 UTC], ["updated_at", 2017-04-06 21:34:12 UTC]]