app/views/organizations/show.html.erb


<!-- Review.where(organization_id: 3).pluck("rating").sum / Review.where(organization_id: 3).pluck("rating").length
---
SELECT AVG("reviews"."rating") FROM "reviews" WHERE "reviews"."organization_id" = $1  [["organization_id", 21]]