app/views/reviews/_form.html.erb

<h2>Choose the Organization you Want to Review</h2>
  <%= f.collection_select :organization_id, Organization.all.order(:name),:id,:name %>
---
SELECT "organizations".* FROM "organizations" ORDER BY "organizations"."name" ASC